import time

print('\n' * 100000)

print("""
________________________________
|                               |
|        Десять вопросов        |
|          по основам           |
|              ЯП               |
|_______________________________|
""")
time.sleep(3)
print('\n' * 100000)


for time_to_start in range(5,0,-1):
    print("""
________________________________
|                               |
|                               |
|          До начала """+ str(time_to_start) + """!         |
|                               |
|_______________________________|
""")
    time.sleep(1)
    print('\n' * 10000)

questions = ['Как зовут преподавателя?', 'Какому ЯП ты приш(ел|ла) учиться?', 'Символ однострочного комментария?',
             'Как привести \'s\' к строке?', 'Как узнать длинну строки \'s\'?', 'a, b = 768, 365 ; Чему равно b?',
             'Как узнать тип объекта \'s\'?','как экранировать символы?', 'Чему равно \'а\' из вопроса 6?', 'В чем смысл жизни?']

answers_true = ['никита', 'python', '#', 'str(s)', 'len(s)',
                '365', 'type(s)', '\\', '768', '42']

answer = []
good_answer = 0

for question in range(10):

    answer.append(input("""
   ________________________________
   |                               |
   |           Вопрос  """ + str(question + 1) + """           |
   |                               |

 >>>""" + questions[question] + """" <<<

   |                               |
   |      Ответ в любом регистре   |
   |_______________________________|\n
"""))
    print('\n')
    if answer[question].lower() == answers_true[question]:
        print("Ты прав(а)!")
        good_answer += 1
    else:
        print("Ты не прав(а)!")
    time.sleep(2)
    print('\n' * 100000)


print('\n' * 3)
print("Ты ответил(а) правильно на {} из 10 вопросов".format(good_answer))

